{
    "Graduation": [{
        "en": {
            "title": "Multi-Level Traffic Routing",
            "position": "NaN",
            "time": "Mar 2024 - May 2024",
            "desc": "The topic of my graduation project is \"Design and Implementation of a Multi-Level Transportation Network Path Planning System.\" The research focuses on proposing a new algorithm to efficiently calculate the shortest path, applied in public transportation for a more personalized travel experience. I independently completed all code, data acquisition, frontend and backend design, and database development.",
            "impl": [{
                "title": "Data",
                "content": "Data for the project was sourced from GaoDe Maps, Beijing Subway, BJMTR, Beijing Public Transit, 8684.cn, and 12306 using Python, with some data manually collected and organized. After acquisition, the data was cleaned to remove errors and standardized for project consistency."
            }, {
                "title": "Database",
                "content": "The project uses MongoDB, a non-relational database, for data storage. The database includes nine collections: Station, Route, Generic, Objects, Transfer, Fee, Distance, StationSchedule, and ObjectSchedule."
            }, {
                "title": "Front-End",
                "content": "The frontend is designed using HTML5, CSS3, and jQuery, displaying information about the current station. Users can also plan routes directly through the interface."
            }, {
                "title": "Back-End",
                "content": "The backend has two parts: a Java/SpringBoot backend for data storage, interactions, and page data retrieval, and a Python/Flask backend for algorithm responses. The frontend sends calculation data to Java, which retrieves details and requests further processing from Python."
            }],
            "features": [{
                "title": "Personalized Route Planning",
                "content": "Users can customize travel conditions, such as avoiding specific transportation modes or routes, or specifying required waypoints. The system then calculates the optimal path based on these constraints, offering a more tailored travel experience."
            }, {
                "title": "MLTR Algorithm",
                "content": "This project introduces a novel algorithm based on Depth-First Search (DFS), capable of performing path planning on a dynamically changing graph that varies over time. The algorithm provides different route recommendations based on specific timeframes and utilizes lazy loading, ensuring that only essential graph data is processed, optimizing efficiency and reducing resource consumption."
            }],
            "key-achievements": [
                "Built the multi-level transportation network path planning system from scratch, covering data acquisition, frontend and backend development, database design, and algorithm implementation, ensuring system completeness and efficiency.",
                "Designed a path planning algorithm based on Depth-First Search (DFS), capable of calculating optimal routes on a dynamically changing transportation network, utilizing lazy loading to improve efficiency and reduce resource consumption.",
                "Developed a Frontend-Backend Decoupled Architecture: Developed the frontend with HTML5, CSS3, and jQuery, providing an intuitive interface for station queries and route planning; Implemented a backend using Java/Spring Boot for data management and Python/Flask for algorithmic computations, ensuring system stability and efficiency.",
                "Designed and implemented nine database collections in MongoDB, including stations, routes, and transfer information, optimizing query efficiency and supporting large-scale transportation data storage and retrieval."
            ]
        },
        "zh": {
            "title": "多层级路径规划系统的设计与实现",
            "position": "NaN",
            "time": "2024 年 3 月 - 2024 年 5 月",
            "desc": "该研究的主题为《多层级交通网络路径规划系统的设计与实现》。本研究旨在提出一种全新的算法，以更高效地计算最短路径，并应用于公共交通领域，以提升个性化出行体验。我独立完成了所有代码编写、数据采集、前后端设计以及数据库设计工作。",
            "impl": [{
                "title": "数据处理",
                "content": "本项目的数据主要通过 Python 爬取自 高德地图、北京地铁（BJMTR）、北京公交、8684.cn 以及 12306，部分数据由手动采集并整理。数据获取后，进行了清洗以去除错误，并标准化处理，以确保项目的一致性。"
            }, {
                "title": "数据库设计",
                "content": "项目采用 MongoDB 作为非关系型数据库进行数据存储。数据库包含 9 个集合（Collections），分别为：站点（Station）、路线（Route）、通用信息（Generic）、对象（Objects）、换乘（Transfer）、费用（Fee）、距离（Distance）、时刻表（StationSchedule）以及对象时刻表（ObjectSchedule）。"
            }, {
                "title": "前端设计",
                "content": "前端使用 HTML5、CSS3 和 jQuery 进行开发，主要用于展示当前站点信息，并支持用户直接在界面上进行路径规划。"
            }, {
                "title": "后端设计",
                "content": "后端由 两部分 组成：Java/Spring Boot 后端 —— 负责数据存储、交互及页面数据查询。Python/Flask 后端 —— 负责路径规划算法计算。前端会将计算数据发送至 Java 端，Java 端检索相关信息，并进一步请求 Python 进行路径的计算。"
            }],
            "features": [{
                "title": "个性化路径规划",
                "content": "用户可以自定义出行条件，例如避开特定交通工具或线路，或者指定必须经过的路段。系统会基于这些约束条件，计算出最符合需求的最优路径，为用户提供更加精准的出行方案。"
            }, {
                "title": "咸鱼算法",
                "content": "本项目提出了一种基于深度优先搜索（DFS）的全新算法，能够在随时间变化的动态图上进行路径规划。该算法可以根据不同时间段提供动态路径方案，并通过懒加载机制，仅加载必要的图数据，即可计算出最优路径，从而提高计算效率并减少资源消耗。"
            }],
            "key-achievements": [
                "从零构建整个多层级交通网络路径规划系统，涵盖数据采集、前后端开发、数据库设计及算法实现，确保系统完整性与高效性。",
                "设计了一种基于 深度优先搜索（DFS） 的路径规划算法，能够在动态变化的交通网络上计算最优路径，并通过 懒加载机制 提高计算效率，减少资源消耗。",
                "构建前后端分离架构：前端使用 HTML5、CSS3、jQuery，实现直观的交互界面，支持用户查询站点信息及路径规划；后端采用 Java/Spring Boot 进行数据存储与交互，并使用 Python/Flask 进行算法计算，确保系统稳定高效运行。",
                "设计并实现 9 个数据库集合（Collections），包括站点、路线、换乘信息等，优化查询效率，支持大规模交通数据存储和快速检索。"
            ]
        }
    }],
    "Personal": [{
        "en": {
            "title": "seechen.github.io",
            "position": "Design, Development.",
            "time": "Jun 2021 - Current",
            "desc": "This personal website is hosted on the GitHub Pages platform and fully developed by myself. While some functions draw inspiration from frameworks like Vue.js, they have been adapted and optimized specifically for this website. The UI/UX design of the website is entirely original, designed, and implemented by me.",
            "impl": [{
                "title": "Data Handling",
                "content": "All data is stored in JSON files to simulate the interaction between the frontend and a backend server. This approach mirrors real-world scenarios where backends commonly return JSON-formatted data."
            }, {
                "title": "Routing Mechanism",
                "content": "By studying the mechanisms of GitHub Pages, I implemented a custom SPA routing system that handles route changes and content access within a purely frontend architecture."
            }],
            "features": [{
                "title": "Single-Page Application (SPA)",
                "content": "The website functions as a seamless single-page application."
            }, {
                "title": "Pseudo-Dynamic Website",
                "content": "Implements dynamic-like behavior without a backend server."
            }, {
                "title": "Multimedia Support",
                "content": " Includes rich multimedia elements for enhanced user experience."
            }, {
                "title": "English and Chinese",
                "content": "Supports switching between different languages."
            }],
            "key-achievements": [
                "Designed and developed the website from scratch, ensuring a deep understanding of frontend technologies and GitHub Pages' capabilities.",
                "Successfully adapted advanced concepts from modern frameworks like Vue.js into native JavaScript solutions tailored to the project's requirements.",
                "Demonstrated proficiency in UI design by creating an intuitive and visually appealing user interface."
            ]
        },
        "zh": {
            "title": "seechen.github.io",
            "position": "设计，开发。",
            "time": "2021 年 6 月 - 至今",
            "desc": "这个个人网站托管在 GitHub Pages 平台上，由我独立设计和开发。部分功能参考了 Vue.js 等框架的思想，但经过深度优化，以更契合本网站的需求。网站的 UI/UX 设计完全原创，从构思到实现均由我亲自完成。",
            "impl": [{
                "title": "数据处理",
                "content": "所有数据均存储在 JSON 文件中，以模拟前端与后端服务器的交互方式。这种方式贴合实际开发场景，符合后端通常返回 JSON 格式数据的常见模式。"
            }, {
                "title": "路由机制",
                "content": "通过研究 GitHub Pages 的工作原理，我实现了一套自定义的 SPA（单页应用）路由系统，在纯前端架构下高效管理路由变化与内容访问。"
            }],
            "features": [{
                "title": "单页应用（SPA）",
                "content": "网站采用无缝切换的单页应用架构，提升交互体验。"
            }, {
                "title": "伪动态网站",
                "content": "在无后端服务器的情况下，实现类似动态网站的效果。"
            }, {
                "title": "多媒体支持",
                "content": "内置丰富的多媒体元素，增强用户体验。"
            }, {
                "title": "中英文切换",
                "content": "支持多语言模式，可在英文与中文之间自由切换。"
            }],
            "key-achievements": [
                "从零构建整个网站，深入掌握前端技术，并充分利用 GitHub Pages 的特性。",
                "将 Vue.js 等现代框架的先进理念灵活应用于原生 JavaScript，实现符合项目需求的优化方案。",
                "设计并实现直观且美观的用户界面，展现出色的界面设计与用户体验优化能力。"
            ]
        }
    }],
    "School": [{
        "en": {
            "title": "Little Blue Birds",
            "position": "Team Leader, Front-end, Back-end.",
            "time": "Dec 2022 - Jan 2023",
            "desc": "This project was a team assignment involving four members. One member was responsible for Android development, another for UI design, while the remaining two worked on the web frontend and backend. As the team leader, I coordinated tasks and was primarily responsible for implementing both frontend and backend code.",
            "impl": [{
                "title": "Database Design",
                "content": "The project uses MongoDB, a document-based NoSQL database, to efficiently store and manage data. It includes two primary collections: </br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;User Collection: Stores user-related data, including username, password, full name, number of likes, received likes, posts count, shares count, and profile picture.</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Post Collection: Stores post-related information such as the number of likes, last edited time, number of comments, comment content, shares count, title, and main content."
            }, {
                "title": "Project Architecture",
                "content": "The system follows a frontend-backend separation architecture. The backend is developed using Java + Spring Boot with an MVC design pattern, structured into the following layers:</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1. Controller Layer: Handles frontend requests and routes.</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2. Service Layer: Defines business logic interfaces.</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3. ServiceImpl Layer: Implements business logic and interacts with the DAO layer.</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4. DAO Layer: Handles database operations.</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;5. Entity Layer: Maps database fields to Java objects."
            }, {
                "title": "Frontend Development",
                "content": "The frontend is developed using HTML5 + CSS3 + jQuery, following an MPA (Multi-Page Application) architecture. And it interacts with the backend through asynchronous requests, ensuring data consistency and real-time updates."
            }, {
                "title": "Server Deployment",
                "content": "The project is deployed on Alibaba Cloud Servers with a Linux-based environment. And the server configurations are optimized for stability and high availability."
            }, {
                "title": "Code Management",
                "content": "1. Git is used for version control, and the project is synchronized through GitHub & GitLab.</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2. Adopts standardized Git commit conventions, ensuring maintainability and traceability."
            }],
            "features": [{
                "title": "Comprehensive User System",
                "content": "✅ Supports user registration & login, with encrypted password storage for security.</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;✅ Personalized user profiles displaying avatars, post counts, likes, and shares.</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;✅ Interactive follow/unfollow features, enhancing the social aspect."
            }, {
                "title": "Rich Social Interaction",
                "content": "✅ Posting system with text & multimedia content support, allowing editing and deletion.</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;✅ Comment system: Supports multi-level comments.</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;✅ Like & Share: Users can like posts and repost them to their profile for greater visibility."
            }, {
                "title": "Robust Backend System",
                "content": "✅ Spring Boot + MVC architecture, ensuring clean logic and scalability.</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;✅ MongoDB storage, efficiently handling large-scale social data.</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;✅ RESTful API design, supporting seamless frontend-backend communication."
            }, {
                "title": "Performance Optimization",
                "content": "✅ AJAX-based asynchronous requests, reducing page reloads and improving user experience.</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;✅ Lazy loading for optimized data rendering.</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;✅ Pagination queries for posts & comments, preventing database overload."
            }],
            "key-achievements": [
                "Successfully implemented the core features of a social networking site, building a fully functional platform. The system supports user registration, login, personal profiles, posting, commenting, liking, and sharing, effectively replicating the primary interaction experience of a social platform. Additionally, utilized MongoDB for data management, optimizing the database structure to improve query efficiency and ensure system stability and data consistency.",
                "The project follows a frontend-backend decoupled architecture, significantly improving system scalability. On the frontend, adopted an MPA (Multi-Page Application) model to enable smooth page transitions and enhance user experience. On the backend, implemented Java + Spring Boot + MVC, ensuring a well-structured and efficient API interaction process.",
                "By leveraging AJAX for asynchronous data interactions, minimized page reloads and improved system response speed, delivering a more seamless and efficient user experience.",
                "The project is deployed on Alibaba Cloud, with optimizations made for the Linux server environment to enhance system security and stability.",
                "Used GitHub & GitLab for version control and adhered to structured Git branching strategies (such as Feature Branch and Main Branch) to ensure maintainability and traceability. Additionally, implemented a Pull Request + Code Review mechanism to improve code quality and enhance team collaboration efficiency."
            ]
        },
        "zh": {
            "title": "小蓝鸟",
            "position": "组长，前端，后端。",
            "time": "2022 年 12 月 - 2023 年 1 月",
            "desc": "本项目由四人团队合作完成，分工如下：一名成员负责 Android 端开发，另一名成员负责界面设计，其余两人负责 Web 端的前后端开发。我担任团队负责人，负责任务协调，并主要承担前后端代码的实现工作。",
            "impl": [{
                "title": "数据库设计",
                "content": "本项目采用 MongoDB 作为文档型数据库，实现高效的数据存储与管理。数据库包含两个主要 Collection（集合）：</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;User（用户数据）：存储用户的用户名、密码、姓名、点赞数、被点赞数、发帖数、转发数、头像等信息。</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Post（帖子数据）：记录帖子的点赞数、最后编辑时间、评论数量、评论内容、转发数量、标题、正文等信息。"
            }, {
                "title": "项目架构",
                "content": "项目采用 前后端分离架构，后端使用 Java + Spring Boot 框架，并基于 MVC 设计模式 进行开发。代码主要分为以下几层：</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1. Controller 层：处理前端请求，负责路由控制。</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2. Service 层：定义业务逻辑接口。</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3. ServiceImpl 层：实现业务逻辑，调用 DAO 层方法。</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4. DAO 层：负责数据库操作。</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;5. Entity 层：封装数据对象，与数据库字段映射。"
            }, {
                "title": "前端设计",
                "content": "前端采用 HTML5 + CSS3 + jQuery 进行开发，并采用 MPA（多页应用）架构，确保页面交互的稳定性。前端通过异步请求与后端进行数据交互，确保数据的一致性与实时性。"
            }, {
                "title": "服务器部署",
                "content": "采用 阿里云服务器 进行部署，并使用 Linux 操作系统 进行环境搭建和项目运行。以及通过服务器环境优化，确保系统稳定性与高可用性。"
            }, {
                "title": "代码管理",
                "content": "采用 Git 进行版本控制，并通过 GitHub & GitLab 进行代码托管和团队协作。并规范化 Git 提交记录，确保代码可维护性和版本可追溯性。"
            }],
            "features": [{
                "title": "用户系统",
                "content": "✅ 支持用户注册 & 登录，使用加密存储（MD5） 确保账户安全。</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;✅ 个人主页可查看用户头像、昵称、发帖数、点赞数、转发数等信息。</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;✅ 用户互动：支持关注 / 取消关注、查看关注列表，增强社交属性。"
            }, {
                "title": "社交互动",
                "content": "✅ 发帖功能：支持 文本、图片等多媒体内容，可编辑、删除。</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;✅ 评论系统：帖子下可进行多级评论。</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;✅ 点赞 & 转发：用户可点赞帖子，并转发至个人主页，扩展影响力。"
            }, {
                "title": "强大后端支持",
                "content": "✅ 采用 Spring Boot + MVC 架构，逻辑清晰，便于扩展维护。</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;✅ MongoDB 数据存储，结构灵活，可高效处理社交平台的大量数据。</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;✅ RESTful API 设计，支持前后端分离，提高数据交互效率。"
            }, {
                "title": "性能优化",
                "content": "✅ AJAX 异步请求，减少页面刷新，提高用户体验流畅度。</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;✅ Lazy Loading（懒加载）：按需加载数据，降低页面渲染压力。</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;✅ 分页加载：帖子、评论等采用 分页查询，提高查询效率，避免数据库压力过大。"
            }],
            "key-achievements": [
                "成功实现了一个社交网站的核心功能，构建了完整的平台。平台支持用户注册、登录、个人主页、发帖、评论、点赞、转发等功能，完整还原了社交平台的主要交互体验。除此之外，采用 MongoDB 进行数据管理，优化数据结构，提高查询效率，确保系统的稳定性和数据一致性。",
                "本项目采用了 前后端分离架构，大幅提升了系统的可拓展性。在前端开发中，采用了 MPA（多页应用） 模式，使得页面切换更加流畅，并优化了用户体验。在后端，使用 Java + Spring Boot + MVC 进行开发，确保 API 交互逻辑高效且清晰。",
                "通过 AJAX 进行数据的异步交互，减少了页面刷新次数，提高了系统的响应速度，使用户体验更加流畅和高效。",
                "本项目部署在阿里云服务器上，并针对 Linux 服务器环境进行了优化，进一步提升了系统的安全性与稳定性。",
                "采用 GitHub & GitLab 进行代码管理，并严格遵循 Git 分支管理策略（如 Feature Branch、Main Branch），确保代码的可维护性和可追溯性。此外，通过 Pull Request + Code Review 机制，提升代码质量，增强团队协作效率。"
            ]
        }
    }]
}